#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cohky/invite/runs/run-d1smXjPwkFxTD79R

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.invite-ydkk will be created
  + resource "heroku_app" "invite-ydkk" {
      + acm                   = false
      + all_config_vars       = (sensitive value)
      + buildpacks            = [
          + "heroku/go",
        ]
      + config_vars           = {
          + "APP_ENV"       = "production"
          + "DISCORD_TOKEN" = "OTA5MzEzMTIzMjcyNTE5NzMx.YZCd1g.BiKg_0oh5CxouceP_gclcoWweLk"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = false
      + name                  = "invite-ydkk"
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "heroku-20"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.invite-ydkk will be created
  + resource "heroku_build" "invite-ydkk" {
      + app_id            = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = "SHA256:bfdffad7bf5d77407fd018224f923af9bbee92e1c06c47181b897076946bc7c8"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "."
        }
    }

  # heroku_formation.worker will be created
  + resource "heroku_formation" "worker" {
      + app_id   = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "worker"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "HEROKU_EMAIL" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "HEROKU_API_KEY" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @cohky16, Action: `pull_request`*